content/network/wireshark网络分析就这么简单.org
# -*- coding:utf-8-*-
#+TITLE: wireshark 网络分析就这么简单
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com
* 从一道面试题说起
  知识点：（第三章）
  + IP 地址分分类，子网划分，子网掩码作用。
  + IP 选路。
* 小试牛刀
  什么是 vlan？

* excel 文件的保存过程

* 你一定喜欢的技巧
  + 抓包的时候只抓必要的部分。
    + 只抓包头。
    + 过滤。
    + 做标记。

* 快递员的工作
  tcp windows scale

* 重传的讲究
  能导致网络拥塞的数据量称为拥塞点。

  + 慢启动
  + 拥塞避免（注意临界窗口取值）
  + 超时重传，RTO
  + 调整拥塞窗口临界值
  + 快速重传
  + 快速恢复


  收到缺失的后续包如何处理？有三种方案
  + 缺失包之后的所有包都重传。（原始）
  + 顺序发送丢失和确认。（NewReno）
  + 将已收到的包通告发送端（SACK）

* 延迟确认和 Nagle 算法
  延迟确认：如果收到一个包后暂时没有什么数据要发送，就延迟一段时间再确认。如果折算时间内恰好有数据要发送，那确认信息就可以和数据在一个包里发出去了。

  Nagle 算法：在发出去的数据还没有被确认之前，假如又有小数据生成，那就把小数据收集起来，凑满一个 MSS 或者等收到确认后再发送。

  延迟确认和 Nagle 算法并没有提高性能，它只是减少了部分确认包，减轻了网络负担。

* 百家争鸣
  各种拥塞避免算法：
  + RFC2001，
  + westwood 算法
  + Vegas 算法

* DNS 小科普
  A 记录与 CNAME

  递归查询与迭代查询

  DNS 循环工作模式，广泛用于负载平衡。

* FTP
  主动模式和被动模式。

* HTTP

* Tshark
  Tshark 命令行使用技巧。
