network/wireshark网络分析就这么简单.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-05 一 20:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>wireshark 网络分析就这么简单</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">wireshark 网络分析就这么简单</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf01d8f0">1. 从一道面试题说起</a></li>
<li><a href="#orgcad54dc">2. 小试牛刀</a></li>
<li><a href="#org547b0f4">3. excel 文件的保存过程</a></li>
<li><a href="#org1dd65c7">4. 你一定喜欢的技巧</a></li>
<li><a href="#org19e41ab">5. 快递员的工作</a></li>
<li><a href="#org98d62fb">6. 重传的讲究</a></li>
<li><a href="#orgaf45c4e">7. 延迟确认和 Nagle 算法</a></li>
<li><a href="#org3b947a4">8. 百家争鸣</a></li>
<li><a href="#org190134d">9. DNS 小科普</a></li>
<li><a href="#orgf4b2069">10. FTP</a></li>
<li><a href="#orgd9a5242">11. HTTP</a></li>
<li><a href="#org30fc22b">12. Tshark</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgf01d8f0" class="outline-2">
<h2 id="orgf01d8f0"><span class="section-number-2">1</span> 从一道面试题说起</h2>
<div class="outline-text-2" id="text-1">
<p>
知识点：（第三章）
</p>
<ul class="org-ul">
<li>IP 地址分分类，子网划分，子网掩码作用。</li>
<li>IP 选路。</li>
</ul>
</div>
</div>
<div id="outline-container-orgcad54dc" class="outline-2">
<h2 id="orgcad54dc"><span class="section-number-2">2</span> 小试牛刀</h2>
<div class="outline-text-2" id="text-2">
<p>
什么是 vlan？
</p>
</div>
</div>

<div id="outline-container-org547b0f4" class="outline-2">
<h2 id="org547b0f4"><span class="section-number-2">3</span> excel 文件的保存过程</h2>
</div>

<div id="outline-container-org1dd65c7" class="outline-2">
<h2 id="org1dd65c7"><span class="section-number-2">4</span> 你一定喜欢的技巧</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>抓包的时候只抓必要的部分。
<ul class="org-ul">
<li>只抓包头。</li>
<li>过滤。</li>
<li>做标记。</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org19e41ab" class="outline-2">
<h2 id="org19e41ab"><span class="section-number-2">5</span> 快递员的工作</h2>
<div class="outline-text-2" id="text-5">
<p>
tcp windows scale
</p>
</div>
</div>

<div id="outline-container-org98d62fb" class="outline-2">
<h2 id="org98d62fb"><span class="section-number-2">6</span> 重传的讲究</h2>
<div class="outline-text-2" id="text-6">
<p>
能导致网络拥塞的数据量称为拥塞点。
</p>

<ul class="org-ul">
<li>慢启动</li>
<li>拥塞避免（注意临界窗口取值）</li>
<li>超时重传，RTO</li>
<li>调整拥塞窗口临界值</li>
<li>快速重传</li>
<li>快速恢复</li>
</ul>


<p>
收到缺失的后续包如何处理？有三种方案
</p>
<ul class="org-ul">
<li>缺失包之后的所有包都重传。（原始）</li>
<li>顺序发送丢失和确认。（NewReno）</li>
<li>将已收到的包通告发送端（SACK）</li>
</ul>
</div>
</div>

<div id="outline-container-orgaf45c4e" class="outline-2">
<h2 id="orgaf45c4e"><span class="section-number-2">7</span> 延迟确认和 Nagle 算法</h2>
<div class="outline-text-2" id="text-7">
<p>
延迟确认：如果收到一个包后暂时没有什么数据要发送，就延迟一段时间再确认。如果折算时间内恰好有数据要发送，那确认信息就可以和数据在一个包里发出去了。
</p>

<p>
Nagle 算法：在发出去的数据还没有被确认之前，假如又有小数据生成，那就把小数据收集起来，凑满一个 MSS 或者等收到确认后再发送。
</p>

<p>
延迟确认和 Nagle 算法并没有提高性能，它只是减少了部分确认包，减轻了网络负担。
</p>
</div>
</div>

<div id="outline-container-org3b947a4" class="outline-2">
<h2 id="org3b947a4"><span class="section-number-2">8</span> 百家争鸣</h2>
<div class="outline-text-2" id="text-8">
<p>
各种拥塞避免算法：
</p>
<ul class="org-ul">
<li>RFC2001，</li>
<li>westwood 算法</li>
<li>Vegas 算法</li>
</ul>
</div>
</div>

<div id="outline-container-org190134d" class="outline-2">
<h2 id="org190134d"><span class="section-number-2">9</span> DNS 小科普</h2>
<div class="outline-text-2" id="text-9">
<p>
A 记录与 CNAME
</p>

<p>
递归查询与迭代查询
</p>

<p>
DNS 循环工作模式，广泛用于负载平衡。
</p>
</div>
</div>

<div id="outline-container-orgf4b2069" class="outline-2">
<h2 id="orgf4b2069"><span class="section-number-2">10</span> FTP</h2>
<div class="outline-text-2" id="text-10">
<p>
主动模式和被动模式。
</p>
</div>
</div>

<div id="outline-container-orgd9a5242" class="outline-2">
<h2 id="orgd9a5242"><span class="section-number-2">11</span> HTTP</h2>
</div>

<div id="outline-container-org30fc22b" class="outline-2">
<h2 id="org30fc22b"><span class="section-number-2">12</span> Tshark</h2>
<div class="outline-text-2" id="text-12">
<p>
Tshark 命令行使用技巧。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-08-05 一 20:29</p>
<p class="validation"></p>
</div>
</body>
</html>
